docs/posts/2015-01-13-reinstalling-apps-from-mac-app-store.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 20, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reinstalling Apps from Mac App Store</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Reinstalling Apps from Mac App Store</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
I was having some trouble with BBEdit on one of my machines, so I decided to delete and reinstall the application. That&rsquo;s not very difficult in ordinary circumstances, but since I bought from the App Store, it should have been even easier. There should be no need to enter any license information, just a click and install.
</p>

<p>
First, I deleted the app. I deleted BBEdit from the applications folder. Somehow, it was still in Launchpad. So, I deleted it from Launchpad. Surely that would be enough.
</p>

<p>
Unfortunately, after I deleted the application, the App Store still thought that it was installed and wouldn&rsquo;t let me download another copy. With the aid of a great little application called <a href="http://apps.tempel.org/FindAnyFile/">Find Any File</a>, I removed every trace of BBEdit from the machine, including all preference files and application support files.
</p>

<p>
The App Store was still convinced that it was installed.
</p>

<p>
Then, I began searching the internet, which revealed some frustrated App Store customers, who were mostly frustrated with their Xcode experience. The search didn&rsquo;t help.
</p>

<p>
For some reason, I decided to go back to Launchpad and saw the BBEdit icon there. I clicked it and BBEdit started right up, though without my usual color scheme since I had deleted the application support folder. So, where was the file? On a whim, I disconnected my backup drive, opened the App Store, and BBEdit was finally gone with the option to install. I Pressed the install button, and BBEdit was automatically installed.
</p>

<p>
Lesson: Launchpad sees apps on external drives, so disconnect any external drives to install a deleted app to your main drive. Then, reinstalling <b>should</b> be the quick and easy process that it&rsquo;s supposed to be.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 20, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
